hw-acceptance-unit-test-cycle/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title"], ["rating", "R"], ["created_at", "2018-02-26 10:25:28.139994"], ["updated_at", "2018-02-26 10:25:28.139994"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def same_director
    @movie = Movie.find(params[:id])