hw-rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

      redirect_to movies_path(optional_hash)
    end

    @movies = Movie.where(:rating => @rating_selected)
    if @date
      @movies = @movies.order(:release_date)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Aladdin_a"], ["updated_at", "2018-02-18 16:26:21.986385"], ["id", 1]]